
const data = {
    "result": [
        {
            "name": "天王盖地虎",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "宝塔镇河妖",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "锄禾日当午",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "汗滴禾下土",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "谁知盘中餐",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "粒粒皆辛苦",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "套路深钢磨成针",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "这个世界都是假的",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "套路深钢磨成针",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "套路深钢磨成针",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "天王盖地虎",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "宝塔镇河妖",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "锄禾日当午",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "汗滴禾下土",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "谁知盘中餐",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "粒粒皆辛苦",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "套路深钢磨成针",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "这个世界都是假的",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "套路深钢磨成针",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "天王盖地虎",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "宝塔镇河妖",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "锄禾日当午",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "汗滴禾下土",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "谁知盘中餐",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "粒粒皆辛苦",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "套路深钢磨成针",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "这个世界都是假的",
            "startTime": "2017-03-02 00:00"
        },
    ],
    "description": "查询成功",
    "flag": "success"
};



const data2 = {
    "result": [
        {
            "name": "天王盖地虎",
            "startTime": "2017-08-02 00:00"
        },
        {
            "name": "宝塔镇河妖",
            "startTime": "2017-08-02 00:00"
        },
        {
            "name": "锄禾日当午",
            "startTime": "2017-09-02 00:00"
        },
        {
            "name": "汗滴禾下土",
            "startTime": "2017-04-02 00:00"
        },
        {
            "name": "谁知盘中餐",
            "startTime": "2017-06-02 00:00"
        },
        {
            "name": "粒粒皆辛苦",
            "startTime": "2017-09-02 00:00"
        },
        {
            "name": "套路深钢磨成针",
            "startTime": "2017-04-02 00:00"
        },
        {
            "name": "这个世界都是假的",
            "startTime": "2017-06-02 00:00"
        },
        {
            "name": "套路深钢磨成针",
            "startTime": "2017-07-02 00:00"
        },
        {
            "name": "套路深钢磨成针",
            "startTime": "2017-09-02 00:00"
        },
        {
            "name": "天王盖地虎",
            "startTime": "2017-00-02 00:00"
        },
        {
            "name": "宝塔镇河妖",
            "startTime": "2017-01-02 00:00"
        },
        {
            "name": "锄禾日当午",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "汗滴禾下土",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "谁知盘中餐",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "粒粒皆辛苦",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "套路深钢磨成针",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "这个世界都是假的",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "套路深钢磨成针",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "天王盖地虎",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "宝塔镇河妖",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "锄禾日当午",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "汗滴禾下土",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "谁知盘中餐",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "粒粒皆辛苦",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "套路深钢磨成针",
            "startTime": "2017-03-02 00:00"
        },
        {
            "name": "这个世界都是假的",
            "startTime": "2017-03-02 00:00"
        },
    ],
    "description": "查询成功",
    "flag": "success"
};


class DataSource {
    static data:data;
}


export {data,data2}